In [1]:
import pandas as pd

In [2]:
data1=pd.Series([1,2,3])
data3=pd.Series([10,20,30,40])
data1+data3

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

In [9]:
df1=pd.DataFrame(data={"a":[1,2],"b":[3,4]})
df2=pd.DataFrame(data={"a":[4,5],"b":[6,7]})

In [10]:
df1+df2

   a   b
0  5   9
1  7  11

In [11]:
df3=pd.DataFrame(data={"a":[100,200],"b":[300,400],"c":[500,600]})
df1+df3

     a    b   c
0  101  303 NaN
1  202  404 NaN

In [13]:
titanic=pd.read_excel("titanic3.xls",usecols=['name','fare','survived'])

In [14]:
titanic.head()

   survived                                             name      fare
0         1                    Allen, Miss. Elisabeth Walton  211.3375
1         1                   Allison, Master. Hudson Trevor  151.5500
2         0                     Allison, Miss. Helen Loraine  151.5500
3         0             Allison, Mr. Hudson Joshua Creighton  151.5500
4         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  151.5500

In [15]:
titanic['fare']/2

0       105.66875
1        75.77500
2        75.77500
3        75.77500
4        75.77500
          ...
1304      7.22710
1305      7.22710
1306      3.61250
1307      3.61250
1308      3.93750
Name: fare, Length: 1309, dtype: float64

In [16]:
titanic["Discounted"]=(titanic["fare"]/2).round()
titanic

,survived,name,fare,Discounted
0,1,"Allen, Miss. Elisabeth Walton",211.3375,106.0
1,1,"Allison, Master. Hudson Trevor",151.5500,76.0
2,0,"Allison, Miss. Helen Loraine",151.5500,76.0
3,0,"Allison, Mr. Hudson Joshua Creighton",151.5500,76.0
4,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",151.5500,76.0
...,...,...,...,...
1304,0,"Zabour, Miss. Hileni",14.4542,7.0
1305,0,"Zabour, Miss. Thamine",14.4542,7.0
1306,0,"Zakarian, Mr. Mapriededer",7.2250,4.0
1307,0,"Zakarian, Mr. Ortin",7.2250,4.0
1308,0,"Zimmerman, Mr. Leo",7.8750,4.0